joe-speedboat/embedded.Arduino.LowPower/hardware/ProMiniLP/avr/boards.txt
menu.cpu=Processor

######################################
## Optiboot ProMini Low Power

ProMiniLP.name=ProMini LowPower - atmega328p

ProMiniLP.upload.tool=arduino:avrdude
ProMiniLP.upload.protocol=arduino
ProMiniLP.upload.maximum_size=30720
ProMiniLP.upload.maximum_data_size=2048

ProMiniLP.bootloader.tool=arduino:avrdude
ProMiniLP.bootloader.unlock_bits=0x3F
ProMiniLP.bootloader.lock_bits=0x0F

ProMiniLP.build.board=AVR_PRO
ProMiniLP.build.core=arduino:arduino
ProMiniLP.build.variant=prominilp
ProMiniLP.build.mcu=atmega328p

ProMiniLP.menu.cpu.1MhzIC_bodd=1Mhz - BOD dis.  - int. Clock(CKDIV8)
ProMiniLP.menu.cpu.1MhzIC_bodd.upload.speed=9600
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.low_fuses=0x62
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1MhzIC_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1MhzIC_bodd.build.f_cpu=1000000L

ProMiniLP.menu.cpu.1MhzIC_18v=1Mhz - BOD 1.8V - int. Clock(CKDIV8)
ProMiniLP.menu.cpu.1MhzIC_18v.upload.speed=9600
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.low_fuses=0x62
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.extended_fuses=0x06
ProMiniLP.menu.cpu.1MhzIC_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1MhzIC_18v.build.f_cpu=1000000L

ProMiniLP.menu.cpu.8MhzIC_bodd=8Mhz - BOD dis.  - int. Clock
ProMiniLP.menu.cpu.8MhzIC_bodd.upload.speed=57600
ProMiniLP.menu.cpu.8MhzIC_bodd.bootloader.low_fuses=0xE2
ProMiniLP.menu.cpu.8MhzIC_bodd.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.8MhzIC_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.8MhzIC_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.8MhzIC_bodd.build.f_cpu=8000000L

ProMiniLP.menu.cpu.8MhzIC_18v=8Mhz - BOD 1.8V - int. Clock
ProMiniLP.menu.cpu.8MhzIC_18v.upload.speed=57600
ProMiniLP.menu.cpu.8MhzIC_18v.bootloader.low_fuses=0xE2
ProMiniLP.menu.cpu.8MhzIC_18v.bootloader.high_fuses=0xD4
ProMiniLP.menu.cpu.8MhzIC_18v.bootloader.extended_fuses=0x06
ProMiniLP.menu.cpu.8MhzIC_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.8MhzIC_18v.build.f_cpu=8000000L

ProMiniLP.menu.cpu.1Mhz_bodd=1Mhz - BOD dis.  - ext. Clock(CKDIV8)
ProMiniLP.menu.cpu.1Mhz_bodd.upload.speed=9600
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1Mhz_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1Mhz_bodd.build.f_cpu=1000000L

ProMiniLP.menu.cpu.1Mhz_18v=1Mhz - BOD 1.8V - ext. Clock(CKDIV8)
ProMiniLP.menu.cpu.1Mhz_18v.upload.speed=9600
ProMiniLP.menu.cpu.1Mhz_18v.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.1Mhz_18v.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.1Mhz_18v.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.1Mhz_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.1Mhz_18v.build.f_cpu=1000000L

ProMiniLP.menu.cpu.2Mhz_bodd=2Mhz - BOD dis.  - ext. Clock(CKDIV8)
ProMiniLP.menu.cpu.2Mhz_bodd.upload.speed=9600
ProMiniLP.menu.cpu.2Mhz_bodd.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.2Mhz_bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.2Mhz_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.2Mhz_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.2Mhz_bodd.build.f_cpu=2000000L

ProMiniLP.menu.cpu.2Mhz_18v=2Mhz - BOD 1.8V - ext. Clock(CKDIV8)
ProMiniLP.menu.cpu.2Mhz_18v.upload.speed=9600
ProMiniLP.menu.cpu.2Mhz_18v.bootloader.low_fuses=0x7F
ProMiniLP.menu.cpu.2Mhz_18v.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.2Mhz_18v.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.2Mhz_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_1MHz.hex
ProMiniLP.menu.cpu.2Mhz_18v.build.f_cpu=2000000L

ProMiniLP.menu.cpu.8MHz_bodd=8MHz - BOD dis.  - ext. Clock
ProMiniLP.menu.cpu.8MHz_bodd.upload.speed=57600
ProMiniLP.menu.cpu.8MHz_bodd.bootloader.low_fuses=0xFF
ProMiniLP.menu.cpu.8MHz_bodd.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.8MHz_bodd.bootloader.extended_fuses=0x07
ProMiniLP.menu.cpu.8MHz_bodd.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_8MHz.hex
ProMiniLP.menu.cpu.8MHz_bodd.build.mcu=atmega328p
ProMiniLP.menu.cpu.8MHz_bodd.build.f_cpu=8000000L

ProMiniLP.menu.cpu.8MHz_18v=8MHz - BOD 1.8V - ext. Clock
ProMiniLP.menu.cpu.8MHz_18v.upload.speed=57600
ProMiniLP.menu.cpu.8MHz_18v.bootloader.low_fuses=0xFF
ProMiniLP.menu.cpu.8MHz_18v.bootloader.high_fuses=0xDA
ProMiniLP.menu.cpu.8MHz_18v.bootloader.extended_fuses=0x06
ProMiniLP.menu.cpu.8MHz_18v.bootloader.file=ProMiniLP/ATmegaBOOT_168_atmega328_pro_8MHz.hex
ProMiniLP.menu.cpu.8MHz_18v.build.mcu=atmega328p
ProMiniLP.menu.cpu.8MHz_18v.build.f_cpu=8000000L

